# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [3]:
import pandas as pd
import numpy as np

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [4]:
student_info_df = pd.concat(map(lambda i: pd.read_csv(f"Data/Students_info_{i}.csv"), range(10))) \
    .reset_index(drop=True)
student_mark_df = pd.concat(map(lambda i: pd.read_csv(f"Data/Students_marks_{i}.csv"), range(10))) \
    .reset_index(drop=True)

student_df = pd.merge(student_info_df, student_mark_df, how='inner', on='index')
student_df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [5]:
student_df = student_df.drop(columns=['index'])
student_df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75

#### Задание 3. Выведите на экран размеры полученной таблицы

In [6]:
student_df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [7]:
student_df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [8]:
True in student_df.isna()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [9]:
student_df.loc[:, ["math score", "reading score", "writing score"]].agg("mean")

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [10]:
student_df.loc[:, ["test preparation course", "math score", "reading score", "writing score"]] \
    .groupby(by=["test preparation course"]).mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [11]:
student_df.loc[:, "lunch"].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [12]:
student_df = student_df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})
student_df

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10,88,99,95
996,male,group C,high school,free/reduced,none,group10,62,55,55
997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,female,group D,some college,standard,completed,group10,68,78,77
999,female,group D,some college,free/reduced,none,group10,77,86,86

**Зафиксируем минимальный балл для сдачи экзамена**

In [13]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [14]:
math_success_df = student_df.loc[student_df["math score"] >= passmark]
print(f'math successed students:\t{math_success_df.shape[0] / student_df.shape[0]:.2%}')

prepared_df = student_df.loc[student_df["test preparation"] == 'completed']
prepared_math_success_df = math_success_df.loc[math_success_df["test preparation"] == 'completed']
print(f'math successed prepared students:\t{prepared_math_success_df.shape[0] / prepared_df.shape[0]:.2%}')

woman_df = student_df[student_df["gender"] == 'female']
prepared_woman_df = prepared_df.loc[prepared_df["gender"] == 'female']
print(f'math failed unprepared woman:\t{1 - prepared_woman_df.shape[0] / woman_df.shape[0]:.2%}')

math successed students:	86.50%
math successed prepared students:	92.18%
math failed unprepared woman:	64.48%

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [15]:
%%timeit
# student_df.loc[:, ['race/ethnicity', 'reading score']].groupby(by='race/ethnicity').mean()
student_df.groupby('race/ethnicity')['reading score'].mean()

220 µs ± 19.9 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [16]:
%%timeit
# student_df.loc[:, ['education', 'writing score']].groupby(by='education').min()
student_df.groupby('education')['writing score'].min()

228 µs ± 9.81 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [17]:
%%timeit
student_df.groupby('race/ethnicity')['reading score'].apply(np.mean)

522 µs ± 22.8 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [18]:
%%timeit
student_df.groupby('education')['writing score'].apply(np.min)

445 µs ± 16.1 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [19]:
gender_education_df = pd.pivot_table(data=student_df.drop(['race/ethnicity', 'lunch', 'test preparation', 'group'], axis=1), 
                                  index=['gender', 'education'])
gender_education_df

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [20]:
for exam in ['math', 'reading', 'writing']:
    student_df[f'{exam} pass status'] = student_df[f'{exam} score'].apply(lambda sc: 'F' if sc < passmark else 'P')
math_successed_df = student_df.loc[student_df["math pass status"] == 'P']
math_failed_df = student_df.loc[student_df["math pass status"] == 'F']
print(f'math successed:\t{math_successed_df.shape[0]}', f'math failed:\t{math_failed_df.shape[0]}', sep='\n')

math successed:	865
math failed:	135

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [21]:
student_df['overall pass status'] = student_df.apply(
    lambda ms: 'P' if 'F' not in [ms['math pass status'], ms['reading pass status'], ms['writing pass status']] else 'F',
    axis=1
)
student_df.sample(n=5)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score,math pass status,reading pass status,writing pass status,overall pass status
101,male,group D,bachelor's degree,standard,completed,group2,68,74,74,P,P,P,P
770,male,group B,high school,standard,none,group8,52,48,49,P,F,F,F
988,female,group A,some high school,free/reduced,none,group10,44,45,45,F,F,F,F
667,female,group B,bachelor's degree,free/reduced,none,group7,77,85,87,P,P,P,P
778,female,group A,some college,standard,completed,group8,72,79,82,P,P,P,P

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [22]:
def get_grade(average_mark):
    if average_mark <= 50:
        return 'F'
    elif average_mark <= 60:
        return 'E'
    elif average_mark <= 70:
        return 'D'
    elif average_mark <= 80:
        return 'C'
    elif average_mark <= 90:
        return 'B'
    else:
        return 'A'

student_df['grade'] = student_df.apply(
    lambda ms: get_grade(np.mean([ms['math score'], 
                                  ms['reading score'], 
                                  ms['writing score']])),
    axis=1
)
student_df.groupby('grade')['grade'].count()

grade
A     50
B    144
C    253
D    260
E    184
F    109
Name: grade, dtype: int64